# GetDimensions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..GetDimensions Method
FabricationPart Class See Also
---
Gets all fabrication dimensions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<FabricationDimensionDefinition> GetDimensions()
```

Visual Basic
---
```text
Public Function GetDimensions As IList(Of FabricationDimensionDefinition)
```

Visual C++
---
```text
public:
IList<FabricationDimensionDefinition^>^ GetDimensions()
```

# ### Return Value
Returns an array of fabrication dimensions.
# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace